<a href="https://colab.research.google.com/github/addicted-ai/bank-marketing-classification/blob/main/Bank_Marketing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [21]:
import pandas as pd
import numpy as np

In [22]:
import matplotlib.pyplot as plt
import seaborn as sns

In [23]:
url='https://raw.githubusercontent.com/addicted-ai/bank-marketing-classification/main/train.csv'
df = pd.read_csv(url,delimiter=';')

In [24]:
df

       age           job   marital  education  ... pdays  previous poutcome    y
0       58    management   married   tertiary  ...    -1         0  unknown   no
1       44    technician    single  secondary  ...    -1         0  unknown   no
2       33  entrepreneur   married  secondary  ...    -1         0  unknown   no
3       47   blue-collar   married    unknown  ...    -1         0  unknown   no
4       33       unknown    single    unknown  ...    -1         0  unknown   no
...    ...           ...       ...        ...  ...   ...       ...      ...  ...
45206   51    technician   married   tertiary  ...    -1         0  unknown  yes
45207   71       retired  divorced    primary  ...    -1         0  unknown  yes
45208   72       retired   married  secondary  ...   184         3  success  yes
45209   57   blue-collar   married  secondary  ...    -1         0  unknown   no
45210   37  entrepreneur   married  secondary  ...   188        11    other   no

[45211 rows x 17 columns]

In [25]:
df.shape

(45211, 17)

In [26]:
df.describe()

                age        balance  ...         pdays      previous
count  45211.000000   45211.000000  ...  45211.000000  45211.000000
mean      40.936210    1362.272058  ...     40.197828      0.580323
std       10.618762    3044.765829  ...    100.128746      2.303441
min       18.000000   -8019.000000  ...     -1.000000      0.000000
25%       33.000000      72.000000  ...     -1.000000      0.000000
50%       39.000000     448.000000  ...     -1.000000      0.000000
75%       48.000000    1428.000000  ...     -1.000000      0.000000
max       95.000000  102127.000000  ...    871.000000    275.000000

[8 rows x 7 columns]

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45211 non-null  int64
 1   job        45211 non-null  object
 2   marital    45211 non-null  object
 3   education  45211 non-null  object
 4   default    45211 non-null  object
 5   balance    45211 non-null  int64
 6   housing    45211 non-null  object
 7   loan       45211 non-null  object
 8   contact    45211 non-null  object
 9   day        45211 non-null  int64
 10  month      45211 non-null  object
 11  duration   45211 non-null  int64
 12  campaign   45211 non-null  int64
 13  pdays      45211 non-null  int64
 14  previous   45211 non-null  int64
 15  poutcome   45211 non-null  object
 16  y          45211 non-null  object
dtypes: int64(7), object(10)
memory usage: 5.9+ MB

In [28]:
df.rename(columns={'y':'output'}, inplace=True)

We can see that all 16 columns have `45211` non-null values that's also total row no. So there is no need to check null values or imputation.

## Data Analysis

### Checking Object Columns

In [29]:
obj_cols = list(df.dtypes[df.dtypes==np.object].keys())

In [30]:
for i in obj_cols:
    print('----------', i, '----------\n', df[i].value_counts(),'\n-----------------------------', sep='')

----------job----------
blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: job, dtype: int64
-----------------------------
----------marital----------
married     27214
single      12790
divorced     5207
Name: marital, dtype: int64
-----------------------------
----------education----------
secondary    23202
tertiary     13301
primary       6851
unknown       1857
Name: education, dtype: int64
-----------------------------
----------default----------
no     44396
yes      815
Name: default, dtype: int64
-----------------------------
----------housing----------
yes    25130
no     20081
Name: housing, dtype: int64
-----------------------------
----------loan----------
no     37967
yes     7244
Name: loan, dtype: int64
-----------------------------
----------contact----------
cellular     29285
unknown      13020
telephone     2906
Name: contact, dtype: int64
-----------------------------
----------month----------
may    13766
jul     6895
aug     6247
jun     5341
nov     3970
apr     2932
feb     2649
jan     1403
oct      738
sep      579
mar      477
dec      214
Name: month, dtype: int64
-----------------------------
----------poutcome----------
unknown    36959
failure     4901
other       1840
success     1511
Name: poutcome, dtype: int64
-----------------------------
----------output----------
no     39922
yes     5289
Name: output, dtype: int64
-----------------------------

- We can see the column `output` i.e our output column as 2 levels yes & no.
- `loan`, `housing` & `default` column has also 2 values yes & no.
- `job` column has `288` unknown value. `education` column has `1857` unknow value. These can be imputed.
- `poutcome` has `36959` unknown value, that's fairly large no.

## Creating Dummy Variables:

In [31]:
obj_cols

['job',
 'marital',
 'education',
 'default',
 'housing',
 'loan',
 'contact',
 'month',
 'poutcome',
 'output']

In [32]:
#variable to map

var =  ['default','housing','loan','output']

# Defining the map function
def binary_map(x):
    return x.map({'yes': 1, "no": 0})

# Applying the function 
df[var] = df[var].apply(binary_map)

In [33]:
df[var]

       default  housing  loan  output
0            0        1     0       0
1            0        1     0       0
2            0        1     1       0
3            0        1     0       0
4            0        0     0       0
...        ...      ...   ...     ...
45206        0        0     0       1
45207        0        0     0       1
45208        0        0     0       1
45209        0        0     0       0
45210        0        0     0       0

[45211 rows x 4 columns]

In [34]:
# Creating a dummy variable for some of the categorical variables and dropping the first one.
dummy = pd.get_dummies(df[['job', 'marital', 'education','contact','month','poutcome']], drop_first=True)

# Adding the results to the master dataframe
df = pd.concat([df, dummy], axis=1)

In [35]:
df.head()

   age           job  ... poutcome_success poutcome_unknown
0   58    management  ...                0                1
1   44    technician  ...                0                1
2   33  entrepreneur  ...                0                1
3   47   blue-collar  ...                0                1
4   33       unknown  ...                0                1

[5 rows x 49 columns]

- We can no drop those categorical columns since we already have created dummy variables for them.

In [36]:
df.drop(['job', 'marital', 'education','contact','month','poutcome'], axis=1, inplace=True)
df.head()

   age  default  balance  ...  poutcome_other  poutcome_success  poutcome_unknown
0   58        0     2143  ...               0                 0                 1
1   44        0       29  ...               0                 0                 1
2   33        0        2  ...               0                 0                 1
3   47        0     1506  ...               0                 0                 1
4   33        0        1  ...               0                 0                 1

[5 rows x 43 columns]

In [37]:
y = df.pop('output')
X = df

In [38]:
from sklearn.model_selection import train_test_split

# Specifying seed, so we always get same rows for train and test dataset respectively
np.random.seed(0)

X_train, X_test, y_train, y_test = train_test_split(X, y, train_size = 0.7, random_state = 100, stratify=y)

In [39]:
y_train.value_counts(normalize=True)

0    0.883022
1    0.116978
Name: output, dtype: float64

In [40]:
y_test.value_counts(normalize=True)

0    0.882999
1    0.117001
Name: output, dtype: float64